app/controllers/tasks_controller.rb

SELECT "tasks".* FROM "tasks" WHERE "tasks"."user_id" = ? AND "tasks"."state" = ?  [["user_id", 1], ["state", "to_do"]]
---
  def index
    @to_do = current_user.tasks.where(state: "to_do")

INSERT INTO "tasks" ("content", "state", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["content", "caca"], ["state", "doing"], ["user_id", 1], ["created_at", "2015-11-03 17:40:11.165642"], ["updated_at", "2015-11-03 17:40:11.165642"]]
---
  def create
    @task = current_user.tasks.new(task_params)

    respond_to do |format|
      if @task.save

UPDATE "tasks" SET "state" = ?, "updated_at" = ? WHERE "tasks"."id" = ?  [["state", "doing"], ["updated_at", "2015-11-03 18:51:29.117168"], ["id", 15]]
---
    def change
      @task.update_attributes(state: params[:state])